STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251axx_ca35.h
/*************  Bit definition for ETH_MACMDIOAR register  *************/
#define ETH_MACMDIOAR_GB_Pos                (0U)
#define ETH_MACMDIOAR_GB_Msk                (0x1UL << ETH_MACMDIOAR_GB_Pos)                      /*!< 0x00000001 */
#define ETH_MACMDIOAR_GB                    ETH_MACMDIOAR_GB_Msk                                /*!< GMII Busy */
#define ETH_MACMDIOAR_C45E_Pos              (1U)
#define ETH_MACMDIOAR_C45E_Msk              (0x1UL << ETH_MACMDIOAR_C45E_Pos)                    /*!< 0x00000002 */
#define ETH_MACMDIOAR_C45E                  ETH_MACMDIOAR_C45E_Msk                              /*!< Clause 45 PHY Enable */
#define ETH_MACMDIOAR_GOC_Pos               (2U)
#define ETH_MACMDIOAR_GOC_Msk               (0x3UL << ETH_MACMDIOAR_GOC_Pos)                     /*!< 0x0000000C */
#define ETH_MACMDIOAR_GOC                   ETH_MACMDIOAR_GOC_Msk                               /*!< GMII Operation Command */
#define ETH_MACMDIOAR_GOC_0                 (0x1UL << ETH_MACMDIOAR_GOC_Pos)                     /*!< 0x00000004 */
#define ETH_MACMDIOAR_GOC_1                 (0x2UL << ETH_MACMDIOAR_GOC_Pos)                     /*!< 0x00000008 */
#define ETH_MACMDIOAR_SKAP_Pos              (4U)
#define ETH_MACMDIOAR_SKAP_Msk              (0x1UL << ETH_MACMDIOAR_SKAP_Pos)                    /*!< 0x00000010 */
#define ETH_MACMDIOAR_SKAP                  ETH_MACMDIOAR_SKAP_Msk                              /*!< Skip Address Packet */
#define ETH_MACMDIOAR_CR_Pos                (8U)
#define ETH_MACMDIOAR_CR_Msk                (0xFUL << ETH_MACMDIOAR_CR_Pos)                      /*!< 0x00000F00 */
#define ETH_MACMDIOAR_CR                    ETH_MACMDIOAR_CR_Msk                                /*!< CSR Clock Range */
#define ETH_MACMDIOAR_CR_DIV42              (0x0UL << ETH_MACMDIOAR_CR_Pos)                      /*!< 0x00000000 */
#define ETH_MACMDIOAR_CR_DIV62              (0x1UL << ETH_MACMDIOAR_CR_Pos)                      /*!< 0x00000100 */
#define ETH_MACMDIOAR_CR_DIV16              (0x2UL << ETH_MACMDIOAR_CR_Pos)                      /*!< 0x00000200 */
#define ETH_MACMDIOAR_CR_DIV26              (0x3UL << ETH_MACMDIOAR_CR_Pos)                      /*!< 0x00000300 */
#define ETH_MACMDIOAR_CR_DIV102             (0x4UL << ETH_MACMDIOAR_CR_Pos)                      /*!< 0x00000400 */
#define ETH_MACMDIOAR_CR_DIV124             (0x5UL << ETH_MACMDIOAR_CR_Pos)                      /*!< 0x00000500 */
#define ETH_MACMDIOAR_NTC_Pos               (12U)
#define ETH_MACMDIOAR_NTC_Msk               (0x7UL << ETH_MACMDIOAR_NTC_Pos)                     /*!< 0x00007000 */
#define ETH_MACMDIOAR_NTC                   ETH_MACMDIOAR_NTC_Msk                               /*!< Number of Training Clocks */
#define ETH_MACMDIOAR_NTC_0                 (0x1UL << ETH_MACMDIOAR_NTC_Pos)                     /*!< 0x00001000 */
#define ETH_MACMDIOAR_NTC_1                 (0x2UL << ETH_MACMDIOAR_NTC_Pos)                     /*!< 0x00002000 */
#define ETH_MACMDIOAR_NTC_2                 (0x4UL << ETH_MACMDIOAR_NTC_Pos)                     /*!< 0x00004000 */
#define ETH_MACMDIOAR_RDA_Pos               (16U)
#define ETH_MACMDIOAR_RDA_Msk               (0x1FUL << ETH_MACMDIOAR_RDA_Pos)                    /*!< 0x001F0000 */
#define ETH_MACMDIOAR_RDA                   ETH_MACMDIOAR_RDA_Msk                               /*!< Register/Device Address */
#define ETH_MACMDIOAR_RDA_0                 (0x1UL << ETH_MACMDIOAR_RDA_Pos)                     /*!< 0x00010000 */
#define ETH_MACMDIOAR_RDA_1                 (0x2UL << ETH_MACMDIOAR_RDA_Pos)                     /*!< 0x00020000 */
#define ETH_MACMDIOAR_RDA_2                 (0x4UL << ETH_MACMDIOAR_RDA_Pos)                     /*!< 0x00040000 */
#define ETH_MACMDIOAR_RDA_3                 (0x8UL << ETH_MACMDIOAR_RDA_Pos)                     /*!< 0x00080000 */
#define ETH_MACMDIOAR_RDA_4                 (0x10UL << ETH_MACMDIOAR_RDA_Pos)                    /*!< 0x00100000 */
#define ETH_MACMDIOAR_PA_Pos                (21U)
#define ETH_MACMDIOAR_PA_Msk                (0x1FUL << ETH_MACMDIOAR_PA_Pos)                     /*!< 0x03E00000 */
#define ETH_MACMDIOAR_PA                    ETH_MACMDIOAR_PA_Msk                                /*!< Physical Layer Address */
#define ETH_MACMDIOAR_PA_0                  (0x1UL << ETH_MACMDIOAR_PA_Pos)                      /*!< 0x00200000 */
#define ETH_MACMDIOAR_PA_1                  (0x2UL << ETH_MACMDIOAR_PA_Pos)                      /*!< 0x00400000 */
#define ETH_MACMDIOAR_PA_2                  (0x4UL << ETH_MACMDIOAR_PA_Pos)                      /*!< 0x00800000 */
#define ETH_MACMDIOAR_PA_3                  (0x8UL << ETH_MACMDIOAR_PA_Pos)                      /*!< 0x01000000 */
#define ETH_MACMDIOAR_PA_4                  (0x10UL << ETH_MACMDIOAR_PA_Pos)                     /*!< 0x02000000 */
#define ETH_MACMDIOAR_BTB_Pos               (26U)
#define ETH_MACMDIOAR_BTB_Msk               (0x1UL << ETH_MACMDIOAR_BTB_Pos)                     /*!< 0x04000000 */
#define ETH_MACMDIOAR_BTB                   ETH_MACMDIOAR_BTB_Msk                               /*!< Back to Back transactions */
#define ETH_MACMDIOAR_PSE_Pos               (27U)
#define ETH_MACMDIOAR_PSE_Msk               (0x1UL << ETH_MACMDIOAR_PSE_Pos)                     /*!< 0x08000000 */
#define ETH_MACMDIOAR_PSE                   ETH_MACMDIOAR_PSE_Msk                               /*!< Preamble Suppression Enable */

/*****************  Bit definition for ETH_MACHWF3R register  *****************/
#define ETH_MACHWF3R_NRVF_Pos               (0U)
#define ETH_MACHWF3R_NRVF_Msk               (0x7UL << ETH_MACHWF3R_NRVF_Pos)                      /*!< 0x00000007 */
#define ETH_MACHWF3R_NRVF                   ETH_MACHWF3R_NRVF_Msk                                /*!< Number of Extended VLAN Tag Filters Enabled */
#define ETH_MACHWF3R_CBTISEL_Pos            (4U)
#define ETH_MACHWF3R_CBTISEL_Msk            (0x1UL << ETH_MACHWF3R_CBTISEL_Pos)                   /*!< 0x00000010 */
#define ETH_MACHWF3R_CBTISEL                ETH_MACHWF3R_CBTISEL_Msk                             /*!< Queue/Channel based VLAN tag insertion on Tx enable */
#define ETH_MACHWF3R_DVLAN_Pos              (5U)
#define ETH_MACHWF3R_DVLAN_Msk              (0x1UL << ETH_MACHWF3R_DVLAN_Pos)                     /*!< 0x00000020 */
#define ETH_MACHWF3R_DVLAN                  ETH_MACHWF3R_DVLAN_Msk                               /*!< Double VLAN processing enable */
#define ETH_MACHWF3R_PDUPSEL_Pos            (9U)
#define ETH_MACHWF3R_PDUPSEL_Msk            (0x1UL << ETH_MACHWF3R_PDUPSEL_Pos)                   /*!< 0x00000200 */
#define ETH_MACHWF3R_PDUPSEL                ETH_MACHWF3R_PDUPSEL_Msk                             /*!< Broadcast/Multicast Packet Duplication */
#define ETH_MACHWF3R_FRPSEL_Pos             (10U)
#define ETH_MACHWF3R_FRPSEL_Msk             (0x1UL << ETH_MACHWF3R_FRPSEL_Pos)                    /*!< 0x00000400 */
#define ETH_MACHWF3R_FRPSEL                 ETH_MACHWF3R_FRPSEL_Msk                              /*!< Flexible Receive Parser Selected */
#define ETH_MACHWF3R_FRPBS_Pos              (11U)
#define ETH_MACHWF3R_FRPBS_Msk              (0x3UL << ETH_MACHWF3R_FRPBS_Pos)                     /*!< 0x00001800 */
#define ETH_MACHWF3R_FRPBS                  ETH_MACHWF3R_FRPBS_Msk                               /*!< Flexible Receive Parser Buffer size */
#define ETH_MACHWF3R_FRPES_Pos              (13U)
#define ETH_MACHWF3R_FRPES_Msk              (0x3UL << ETH_MACHWF3R_FRPES_Pos)                     /*!< 0x00006000 */
#define ETH_MACHWF3R_FRPES                  ETH_MACHWF3R_FRPES_Msk                               /*!< Flexible Receive Parser Table Entries size */
#define ETH_MACHWF3R_ESTSEL_Pos             (16U)
#define ETH_MACHWF3R_ESTSEL_Msk             (0x1UL << ETH_MACHWF3R_ESTSEL_Pos)                    /*!< 0x00010000 */
#define ETH_MACHWF3R_ESTSEL                 ETH_MACHWF3R_ESTSEL_Msk                              /*!< Enhancements to Scheduled Traffic Enable */
#define ETH_MACHWF3R_ESTDEP_Pos             (17U)
#define ETH_MACHWF3R_ESTDEP_Msk             (0x7UL << ETH_MACHWF3R_ESTDEP_Pos)                    /*!< 0x000E0000 */
#define ETH_MACHWF3R_ESTDEP                 ETH_MACHWF3R_ESTDEP_Msk                              /*!< Depth of the Gate Control List */
#define ETH_MACHWF3R_ESTWID_Pos             (20U)
#define ETH_MACHWF3R_ESTWID_Msk             (0x3UL << ETH_MACHWF3R_ESTWID_Pos)                    /*!< 0x00300000 */
#define ETH_MACHWF3R_ESTWID                 ETH_MACHWF3R_ESTWID_Msk                              /*!< Width of the Time Interval field in the Gate Control List */
#define ETH_MACHWF3R_FPESEL_Pos             (26U)
#define ETH_MACHWF3R_FPESEL_Msk             (0x1UL << ETH_MACHWF3R_FPESEL_Pos)                    /*!< 0x04000000 */
#define ETH_MACHWF3R_FPESEL                 ETH_MACHWF3R_FPESEL_Msk                              /*!< Frame Preemption Enable */
#define ETH_MACHWF3R_TBSSEL_Pos             (27U)
#define ETH_MACHWF3R_TBSSEL_Msk             (0x1UL << ETH_MACHWF3R_TBSSEL_Pos)                    /*!< 0x08000000 */
#define ETH_MACHWF3R_TBSSEL                 ETH_MACHWF3R_TBSSEL_Msk                              /*!< Time-based scheduling Enable */
#define ETH_MACHWF3R_ASP_Pos                (28U)
#define ETH_MACHWF3R_ASP_Msk                (0x3UL << ETH_MACHWF3R_ASP_Pos)                       /*!< 0x30000000 */
#define ETH_MACHWF3R_ASP                    ETH_MACHWF3R_ASP_Msk                                 /*!< Automotive Safety Package */

/*************  Bit definition for ETH_MACMDIODR register  *************/
#define ETH_MACMDIODR_GD_Pos                (0U)
#define ETH_MACMDIODR_GD_Msk                (0xFFFFUL << ETH_MACMDIODR_GD_Pos)                   /*!< 0x0000FFFF */
#define ETH_MACMDIODR_GD                    ETH_MACMDIODR_GD_Msk                                /*!< GMII Data */
#define ETH_MACMDIODR_GD_0                  (0x1UL << ETH_MACMDIODR_GD_Pos)                      /*!< 0x00000001 */
#define ETH_MACMDIODR_GD_1                  (0x2UL << ETH_MACMDIODR_GD_Pos)                      /*!< 0x00000002 */
#define ETH_MACMDIODR_GD_2                  (0x4UL << ETH_MACMDIODR_GD_Pos)                      /*!< 0x00000004 */
#define ETH_MACMDIODR_GD_3                  (0x8UL << ETH_MACMDIODR_GD_Pos)                      /*!< 0x00000008 */
#define ETH_MACMDIODR_GD_4                  (0x10UL << ETH_MACMDIODR_GD_Pos)                     /*!< 0x00000010 */
#define ETH_MACMDIODR_GD_5                  (0x20UL << ETH_MACMDIODR_GD_Pos)                     /*!< 0x00000020 */
#define ETH_MACMDIODR_GD_6                  (0x40UL << ETH_MACMDIODR_GD_Pos)                     /*!< 0x00000040 */
#define ETH_MACMDIODR_GD_7                  (0x80UL << ETH_MACMDIODR_GD_Pos)                     /*!< 0x00000080 */
#define ETH_MACMDIODR_GD_8                  (0x100UL << ETH_MACMDIODR_GD_Pos)                    /*!< 0x00000100 */
#define ETH_MACMDIODR_GD_9                  (0x200UL << ETH_MACMDIODR_GD_Pos)                    /*!< 0x00000200 */
#define ETH_MACMDIODR_GD_10                 (0x400UL << ETH_MACMDIODR_GD_Pos)                    /*!< 0x00000400 */
#define ETH_MACMDIODR_GD_11                 (0x800UL << ETH_MACMDIODR_GD_Pos)                    /*!< 0x00000800 */
#define ETH_MACMDIODR_GD_12                 (0x1000UL << ETH_MACMDIODR_GD_Pos)                   /*!< 0x00001000 */
#define ETH_MACMDIODR_GD_13                 (0x2000UL << ETH_MACMDIODR_GD_Pos)                   /*!< 0x00002000 */
#define ETH_MACMDIODR_GD_14                 (0x4000UL << ETH_MACMDIODR_GD_Pos)                   /*!< 0x00004000 */
#define ETH_MACMDIODR_GD_15                 (0x8000UL << ETH_MACMDIODR_GD_Pos)                   /*!< 0x00008000 */
#define ETH_MACMDIODR_RA_Pos                (16U)
#define ETH_MACMDIODR_RA_Msk                (0xFFFFUL << ETH_MACMDIODR_RA_Pos)                   /*!< 0xFFFF0000 */
#define ETH_MACMDIODR_RA                    ETH_MACMDIODR_RA_Msk                                /*!< Register Address */
#define ETH_MACMDIODR_RA_0                  (0x1UL << ETH_MACMDIODR_RA_Pos)                      /*!< 0x00010000 */
#define ETH_MACMDIODR_RA_1                  (0x2UL << ETH_MACMDIODR_RA_Pos)                      /*!< 0x00020000 */
#define ETH_MACMDIODR_RA_2                  (0x4UL << ETH_MACMDIODR_RA_Pos)                      /*!< 0x00040000 */
#define ETH_MACMDIODR_RA_3                  (0x8UL << ETH_MACMDIODR_RA_Pos)                      /*!< 0x00080000 */
#define ETH_MACMDIODR_RA_4                  (0x10UL << ETH_MACMDIODR_RA_Pos)                     /*!< 0x00100000 */
#define ETH_MACMDIODR_RA_5                  (0x20UL << ETH_MACMDIODR_RA_Pos)                     /*!< 0x00200000 */
#define ETH_MACMDIODR_RA_6                  (0x40UL << ETH_MACMDIODR_RA_Pos)                     /*!< 0x00400000 */
#define ETH_MACMDIODR_RA_7                  (0x80UL << ETH_MACMDIODR_RA_Pos)                     /*!< 0x00800000 */
#define ETH_MACMDIODR_RA_8                  (0x100UL << ETH_MACMDIODR_RA_Pos)                    /*!< 0x01000000 */
#define ETH_MACMDIODR_RA_9                  (0x200UL << ETH_MACMDIODR_RA_Pos)                    /*!< 0x02000000 */
#define ETH_MACMDIODR_RA_10                 (0x400UL << ETH_MACMDIODR_RA_Pos)                    /*!< 0x04000000 */
#define ETH_MACMDIODR_RA_11                 (0x800UL << ETH_MACMDIODR_RA_Pos)                    /*!< 0x08000000 */
#define ETH_MACMDIODR_RA_12                 (0x1000UL << ETH_MACMDIODR_RA_Pos)                   /*!< 0x10000000 */
#define ETH_MACMDIODR_RA_13                 (0x2000UL << ETH_MACMDIODR_RA_Pos)                   /*!< 0x20000000 */
#define ETH_MACMDIODR_RA_14                 (0x4000UL << ETH_MACMDIODR_RA_Pos)                   /*!< 0x40000000 */
#define ETH_MACMDIODR_RA_15                 (0x8000UL << ETH_MACMDIODR_RA_Pos)                   /*!< 0x80000000 */

/****************  Bit definition for ETH_MACCSRSWCR register  ****************/
#define ETH_MACCSRSWCR_RCWE_Pos             (0U)
#define ETH_MACCSRSWCR_RCWE_Msk             (0x1UL << ETH_MACCSRSWCR_RCWE_Pos)                    /*!< 0x00000001 */
#define ETH_MACCSRSWCR_RCWE                 ETH_MACCSRSWCR_RCWE_Msk                             /*!< Register Clear on Write 1 Enable */
#define ETH_MACCSRSWCR_SEEN_Pos             (8U)
#define ETH_MACCSRSWCR_SEEN_Msk             (0x1UL << ETH_MACCSRSWCR_SEEN_Pos)                    /*!< 0x00000100 */
#define ETH_MACCSRSWCR_SEEN                 ETH_MACCSRSWCR_SEEN_Msk                             /*!< Slave Error Response Enable */

/****************  Bit definition for ETH_MACFPECSR register  *****************/
#define ETH_MACFPECSR_EFPE_Pos              (0U)
#define ETH_MACFPECSR_EFPE_Msk              (0x1UL << ETH_MACFPECSR_EFPE_Pos)                     /*!< 0x00000001 */
#define ETH_MACFPECSR_EFPE                  ETH_MACFPECSR_EFPE_Msk                              /*!< Enable Tx Frame Preemption */
#define ETH_MACFPECSR_SVER_Pos              (1U)
#define ETH_MACFPECSR_SVER_Msk              (0x1UL << ETH_MACFPECSR_SVER_Pos)                     /*!< 0x00000002 */
#define ETH_MACFPECSR_SVER                  ETH_MACFPECSR_SVER_Msk                              /*!< Send Verify mPacket */
#define ETH_MACFPECSR_SRSP_Pos              (2U)
#define ETH_MACFPECSR_SRSP_Msk              (0x1UL << ETH_MACFPECSR_SRSP_Pos)                     /*!< 0x00000004 */
#define ETH_MACFPECSR_SRSP                  ETH_MACFPECSR_SRSP_Msk                              /*!< Send Respond mPacket */
#define ETH_MACFPECSR_ARV_Pos               (3U)
#define ETH_MACFPECSR_ARV_Msk               (0x1UL << ETH_MACFPECSR_ARV_Pos)                      /*!< 0x00000008 */
#define ETH_MACFPECSR_ARV                   ETH_MACFPECSR_ARV_Msk                               /*!< Autogenerate Respond mPacket on receiving Verify mPacket */
#define ETH_MACFPECSR_RVER_Pos              (16U)
#define ETH_MACFPECSR_RVER_Msk              (0x1UL << ETH_MACFPECSR_RVER_Pos)                     /*!< 0x00010000 */
#define ETH_MACFPECSR_RVER                  ETH_MACFPECSR_RVER_Msk                              /*!< Received Verify Frame */
#define ETH_MACFPECSR_RRSP_Pos              (17U)
#define ETH_MACFPECSR_RRSP_Msk              (0x1UL << ETH_MACFPECSR_RRSP_Pos)                     /*!< 0x00020000 */
#define ETH_MACFPECSR_RRSP                  ETH_MACFPECSR_RRSP_Msk                              /*!< Received Respond Frame */
#define ETH_MACFPECSR_TVER_Pos              (18U)
#define ETH_MACFPECSR_TVER_Msk              (0x1UL << ETH_MACFPECSR_TVER_Pos)                     /*!< 0x00040000 */
#define ETH_MACFPECSR_TVER                  ETH_MACFPECSR_TVER_Msk                              /*!< Transmitted Verify Frame */
#define ETH_MACFPECSR_TRSP_Pos              (19U)
#define ETH_MACFPECSR_TRSP_Msk              (0x1UL << ETH_MACFPECSR_TRSP_Pos)                     /*!< 0x00080000 */
#define ETH_MACFPECSR_TRSP                  ETH_MACFPECSR_TRSP_Msk                              /*!< Transmitted Respond Frame */

/****************  Bit definition for ETH_MACPRSTIMR register  ****************/
#define ETH_MACPRSTIMR_MPTN_Pos             (0U)
#define ETH_MACPRSTIMR_MPTN_Msk             (0xFFFFFFFFUL << ETH_MACPRSTIMR_MPTN_Pos)             /*!< 0xFFFFFFFF */
#define ETH_MACPRSTIMR_MPTN                 ETH_MACPRSTIMR_MPTN_Msk                              /*!< MAC 1722 Presentation Time in ns */

/***************  Bit definition for ETH_MACPRSTIMUR register  ****************/
#define ETH_MACPRSTIMUR_MPTU_Pos            (0U)
#define ETH_MACPRSTIMUR_MPTU_Msk            (0xFFFFFFFFUL << ETH_MACPRSTIMUR_MPTU_Pos)            /*!< 0xFFFFFFFF */
#define ETH_MACPRSTIMUR_MPTU                ETH_MACPRSTIMUR_MPTU_Msk                             /*!< MAC 1722 Presentation Time Update */

/**************  Bit definition for ETH_MACA0HR register  **************/
#define ETH_MACA0HR_ADDRHI_Pos              (0U)
#define ETH_MACA0HR_ADDRHI_Msk              (0xFFFFUL << ETH_MACA0HR_ADDRHI_Pos)                 /*!< 0x0000FFFF */
#define ETH_MACA0HR_ADDRHI                  ETH_MACA0HR_ADDRHI_Msk                              /*!< MAC Address0[47:32] */
#define ETH_MACA0HR_ADDRHI_0                (0x1UL << ETH_MACA0HR_ADDRHI_Pos)                    /*!< 0x00000001 */
#define ETH_MACA0HR_ADDRHI_1                (0x2UL << ETH_MACA0HR_ADDRHI_Pos)                    /*!< 0x00000002 */
#define ETH_MACA0HR_ADDRHI_2                (0x4UL << ETH_MACA0HR_ADDRHI_Pos)                    /*!< 0x00000004 */
#define ETH_MACA0HR_ADDRHI_3                (0x8UL << ETH_MACA0HR_ADDRHI_Pos)                    /*!< 0x00000008 */
#define ETH_MACA0HR_ADDRHI_4                (0x10UL << ETH_MACA0HR_ADDRHI_Pos)                   /*!< 0x00000010 */
#define ETH_MACA0HR_ADDRHI_5                (0x20UL << ETH_MACA0HR_ADDRHI_Pos)                   /*!< 0x00000020 */
#define ETH_MACA0HR_ADDRHI_6                (0x40UL << ETH_MACA0HR_ADDRHI_Pos)                   /*!< 0x00000040 */
#define ETH_MACA0HR_ADDRHI_7                (0x80UL << ETH_MACA0HR_ADDRHI_Pos)                   /*!< 0x00000080 */
#define ETH_MACA0HR_ADDRHI_8                (0x100UL << ETH_MACA0HR_ADDRHI_Pos)                  /*!< 0x00000100 */
#define ETH_MACA0HR_ADDRHI_9                (0x200UL << ETH_MACA0HR_ADDRHI_Pos)                  /*!< 0x00000200 */
#define ETH_MACA0HR_ADDRHI_10               (0x400UL << ETH_MACA0HR_ADDRHI_Pos)                  /*!< 0x00000400 */
#define ETH_MACA0HR_ADDRHI_11               (0x800UL << ETH_MACA0HR_ADDRHI_Pos)                  /*!< 0x00000800 */
#define ETH_MACA0HR_ADDRHI_12               (0x1000UL << ETH_MACA0HR_ADDRHI_Pos)                 /*!< 0x00001000 */
#define ETH_MACA0HR_ADDRHI_13               (0x2000UL << ETH_MACA0HR_ADDRHI_Pos)                 /*!< 0x00002000 */
#define ETH_MACA0HR_ADDRHI_14               (0x4000UL << ETH_MACA0HR_ADDRHI_Pos)                 /*!< 0x00004000 */
#define ETH_MACA0HR_ADDRHI_15               (0x8000UL << ETH_MACA0HR_ADDRHI_Pos)                 /*!< 0x00008000 */
#define ETH_MACA0HR_DCS_Pos                 (16U)
#define ETH_MACA0HR_DCS_Msk                 (0x1UL << ETH_MACA0HR_DCS_Pos)                       /*!< 0x00010000 */
#define ETH_MACA0HR_DCS                     ETH_MACA0HR_DCS_Msk                                 /*!< DMA Channel Select */
#define ETH_MACA0HR_AE_Pos                  (31U)
#define ETH_MACA0HR_AE_Msk                  (0x1UL << ETH_MACA0HR_AE_Pos)                        /*!< 0x80000000 */
#define ETH_MACA0HR_AE                      ETH_MACA0HR_AE_Msk                                  /*!< Address Enable */

